//---------------------------------------------------------------------------
// File: interface.h
// By:   HeliSRaiN
//                                                     Подключаемый интерфейс
//---------------------------------------------------------------------------
#pragma once
#ifndef INTERFACE_H
#define INTERFACE_H
//---------------------------------------------------------------------------
#include <windows.h>
#include <conio.h>
#include <iostream>
#include <dos.h>
#include "packcage.h"
//---------------------------------------------------------------------------
#include "../Personal/mywork.h" // Для выполнения индивидуального задания
//---------------------------------------------------------------------------
const int WAIT_TIME = 5000;
const int WAIT_TIME_TO_PRINT = 250;
const int WAIT_TIME_TO_LOGO = 500;
const int WAIT_TIME_TO_HIDE = 2000;
//---------------------------------------------------------------------------
int menuRun(Text *&text);
//---------------------------------------------------------------------------
#endif 