//---------------------------------------------------------------------------
// File: main.cpp
// By:   HeliSRaiN 
//       SnipGhost  
//                                                        Главный файл работы
//---------------------------------------------------------------------------
#include "packcage.h"  // Содержит все необходимые библиотеки и функции
#include "interface.h" // Содержит расширенный графический интерфейс
//---------------------------------------------------------------------------
//#include "../Personal/mywork.h" // Для выполнения индивидуального задания
//---------------------------------------------------------------------------
using namespace std;
//---------------------------------------------------------------------------
int main()
{
	Text *text = NULL;
	menuRun(text); //Визуализированное меню
	return 0;
}
//---------------------------------------------------------------------------