//---------------------------------------------------------------------------
// File: main.cpp
// By:   SnipGhost
//                                                        Главный файл работы
//---------------------------------------------------------------------------
#include "packcage.h"
#include "../Personal/mywork.h"
//---------------------------------------------------------------------------
int main()
{
	system("chcp 1251 > nul");
	Text *text = getText(inputText(cin));
	if (text != NULL) doMyHomeWork(text);
	say("Завершение работы ...");
	return 0;
}
//---------------------------------------------------------------------------