//---------------------------------------------------------------------------
// File: main.cpp
// By:   HeliSRaiN 
//       SnipGhost  
//                                                        Главный файл работы
//---------------------------------------------------------------------------
#include "packcage.h"
#include "Interface.h"
//#include "../Personal/mywork.h"
//---------------------------------------------------------------------------
int main()
{
	system("chcp 1251 > nul");

	//menuRun(); //Визуализированное меню
  
	//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
	Text *text = getText(inputText());
	//if (text != NULL) doMyHomeWork(text);
	//~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

	cout << endl;
	for (int i = 0; i < text->size; ++i) // Проходимся
	{
		Sentence *s = text->sent[i];
		cout << "Предложение #" << i << " " << s << endl;
		for (int j = 0; j < s->size; ++j)
		{
			Word *w = s->word[j];
			cout << "\tСлово #" << j << " " << *w;
			cout << ((w->attr) ? " с атрибутом ','\n" : " без атрибутов\n");
		}
	}

	say("Завершение работы ...");
	delete text;

	return 0;
}
//---------------------------------------------------------------------------