//---------------------------------------------------------------------------
// File: main.cpp
// By:   HeliSRaiN 
//       SnipGhost  
//                                                        Главный файл работы
//---------------------------------------------------------------------------
#include "packcage.h"  // Содержит все необходимые библиотеки и функции
#include "interface.h" // Содержит расширенный графический интерфейс
//---------------------------------------------------------------------------
//#include "../Personal/mywork.h" // Для выполнения индивидуального задания
//---------------------------------------------------------------------------
using namespace std;
//---------------------------------------------------------------------------
int main()
{
	system("chcp 1251 > nul");

	Text *text = NULL;

	menuRun(text); //Визуализированное меню

	say("Завершение работы ..."); // Ну и дичь

	delete text;                  // Не забываем (!) очистить память (!)
	return 0;
}
//---------------------------------------------------------------------------