//---------------------------------------------------------------------------
// File: mywork.h
// By:   SnipGhost
//                                                     Индивидуальное задание
//---------------------------------------------------------------------------
#pragma once      // Используем новые возможности С++
#ifndef MYWORK_H  // Однако сохраняем обратную совместимость
#define MYWORK_H
//---------------------------------------------------------------------------
#include <iostream>
//---------------------------------------------------------------------------
const char name[] = "MyWork-Module";    // Имя модуля, выводящего сообщение
const char delim[] = " say: ";          // Разделитель имени и сообщения
//---------------------------------------------------------------------------
void printMsg(const char *msg);    // Печать сообщения на экран
//---------------------------------------------------------------------------
#endif /* MYWORK_H */
//---------------------------------------------------------------------------